# OpeningId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..OpeningId Property
EnergyAnalysisOpening Class See Also
---
The unique identifier for the opening.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string OpeningId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OpeningId As String
	Get
```

Visual C++
---
```text
public:
property String^ OpeningId {
	String^ get ();
}
```

# Remarks
This identification attribute is composed of the id for the parent surface, the prefix "op" and a sequential number, all separated by "-". A sample value would be "su-1-op-1".
# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace